app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY "messages"."created_at" DESC
---
  def index
    @message = Message.new
    @list_messages = Message.order(created_at: :desc)

INSERT INTO "messages" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "nova msg"], ["created_at", "2021-03-08 01:11:25.340584"], ["updated_at", "2021-03-08 01:11:25.340584"]]
---
  def create
    @message = Message.new message_params

    begin
      @message.save!